efthym/stm32_hal_graphics_display_drivers/Drivers/io_fsmc/lcd_io_fsmc8_hal.c
//-----------------------------------------------------------------------------
/* Fill 24bit bitmap from 16bit color */
void FillConvert16to24(uint16_t color, uint8_t * tg, uint32_t Size)
{
  uint32_t c24;
  #if LCD_REVERSE16 == 0
  c24 = RGB565TO888(color);
  #elif LCD_REVERSE16 == 1
  uint16_t c16 = __REVSH(color);
  c24 = RGB565TO888(c16);
  #endif
  while(Size--)
  {
    *(uint32_t *)tg = c24;
    tg += 3;
  }
}

//-----------------------------------------------------------------------------
/* Convert from 16bit bitmnap to 24bit bitmap */
void BitmapConvert16to24(uint16_t * src, uint8_t * tg, uint32_t Size)
{
  while(Size--)
  {
    #if LCD_REVERSE16 == 0
    *(uint32_t *)tg = RGB565TO888(*src);
    #elif LCD_REVERSE16 == 1
    uint16_t c16 = __REVSH(*src);
    *(uint32_t *)tg = RGB565TO888(c16);
    #endif
    src++;
    tg += 3;
  }
}

//-----------------------------------------------------------------------------
/* SPI DMA operation interrupt */
void HAL_DMA_TxCpltCallback(DMA_HandleTypeDef *hdma)
{
  if(hdma == &LCD_DMA_HANDLE)
  {
    if(dmastatus.size > dmastatus.trsize)
    { /* dma operation is still required */

      if(dmastatus.status == (DMA_STATUS_MULTIDATA | DMA_STATUS_8BIT))
        dmastatus.ptr += dmastatus.trsize;        /* 8bit multidata */
      else if(dmastatus.status == (DMA_STATUS_MULTIDATA | DMA_STATUS_16BIT))
        dmastatus.ptr += dmastatus.trsize << 1;   /* 16bit multidata */
      else if(dmastatus.status == (DMA_STATUS_MULTIDATA | DMA_STATUS_24BIT))
        dmastatus.ptr += dmastatus.trsize << 1;   /* 16 to 24bit multidata */

      dmastatus.size -= dmastatus.trsize;
      if(dmastatus.size <= dmastatus.maxtrsize)
        dmastatus.trsize = dmastatus.size;

      #if LCD_RGB24_BUFFSIZE == 0
      HAL_DMA_Start_IT(&LCD_DMA_HANDLE, dmastatus.ptr, LCD_ADDR_DATA, dmastatus.trsize);
      #else /* #if LCD_RGB24_BUFFSIZE == 0 */
      if(dmastatus.status == (DMA_STATUS_MULTIDATA | DMA_STATUS_24BIT))
      {
        BitmapConvert16to24((uint16_t *)dmastatus.ptr, lcd_rgb24_dma_buffer, dmastatus.trsize);
        HAL_DMA_Start_IT(&LCD_DMA_HANDLE, (uint32_t)&lcd_rgb24_dma_buffer, LCD_ADDR_DATA, dmastatus.trsize * 3);
      }
      else if(dmastatus.status == (DMA_STATUS_FILL | DMA_STATUS_24BIT))
        HAL_DMA_Start_IT(&LCD_DMA_HANDLE, (uint32_t)&lcd_rgb24_dma_buffer, LCD_ADDR_DATA, dmastatus.trsize * 3);
      else
        HAL_DMA_Start_IT(&LCD_DMA_HANDLE, dmastatus.ptr, LCD_ADDR_DATA, dmastatus.trsize);
      #endif /* #if LCD_RGB24_BUFFSIZE == 0 */
    }
    else
    { /* dma operations have ended */
      LcdDmaTransEnd();
      LCD_IO_DmaTxCpltCallback(hdma);
    }
  }
}
#endif /* #if LCD_DMA_TX == 1 */

//-----------------------------------------------------------------------------
/* Wrtite fill and multi data to Lcd (8 and 16 bit mode)
   - pData: 8 or 16 bits data pointer
   - Size: data number
   - dinc: 0=fill mode, 1=multidata mode
   - bitdepth: 0 = 8bit data, 1 = 16bit data */
void LCDWriteFillMultiData8and16(uint8_t * pData, uint32_t Size, uint32_t Mode)
{
  #if LCD_DMA_TX == 1

  #if LCD_REVERSE16 == 0
  if((Size > DMA_MINSIZE) && (!LCD_DMA_UNABLE((uint32_t)pData)) && (Mode & (LCD_IO_FILL | LCD_IO_DATA8 | LCD_IO_DATA16TO24)))
  #elif LCD_REVERSE16 == 1
  if((Size > DMA_MINSIZE) && (!LCD_DMA_UNABLE((uint32_t)pData)))
  #endif
  { /* DMA mode */

    // AE: Even for 16bit DATA, FSMC is 8 bit, so trasfers should be 8bit.
    //    The ref manual for F76x says from AHB to FSMC you can move from a large datum to a smaller (16b -> 8b)
    //    For this the FIFO must be on
    //    It works!
    //    
    //   This DMA channel is memory to memory. However the structures still refer to "periph".
    //   Periph is the source, so real memory and "memory" is FMC-LCD
    LCD_DMA_HANDLE.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    if(Mode & LCD_IO_DATA8)
    { /* 8bit DMA */
      LCD_DMA_HANDLE.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;  
      LCD_DMA_HANDLE.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
      dmastatus.status = DMA_STATUS_8BIT;
    }
    else
    { /* 16bit DMA */
      LCD_DMA_HANDLE.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
      dmastatus.status = DMA_STATUS_16BIT;
    }

    LCD_DMA_HANDLE.Init.MemInc = DMA_MINC_DISABLE;  // AE: in MEM2MEM the source is the "peripheral", so this is the destination

    if(Mode & LCD_IO_FILL)
    { /* fill */
      LCD_DMA_HANDLE.Init.PeriphInc = DMA_PINC_DISABLE;  // AE: Periph means source here, so for fill this is ok
      dmastatus.status |= DMA_STATUS_FILL;
      dmastatus.ptr = (uint32_t)&dmastatus.data;

      if(Mode & LCD_IO_DATA16)
      {
        #if LCD_REVERSE16 == 0
        dmastatus.data = __REVSH(*(uint16_t *)pData);
        #elif LCD_REVERSE16 == 1
        dmastatus.data = *(uint16_t *)pData; 
        #endif
      }
      else
        dmastatus.data = *pData;

    }
    else
    { /* multidata */
      LCD_DMA_HANDLE.Init.PeriphInc = DMA_PINC_ENABLE;  // AE: this is the "source"
      dmastatus.status |= DMA_STATUS_MULTIDATA;
      dmastatus.ptr = (uint32_t)pData;
    }

    dmastatus.size = Size;
    dmastatus.maxtrsize = DMA_MAXSIZE;

    if(Size > DMA_MAXSIZE)
      dmastatus.trsize = DMA_MAXSIZE;
    else /* the transaction can be performed with one DMA operation */
      dmastatus.trsize = Size;

    LCD_DMA_HANDLE.XferCpltCallback = &HAL_DMA_TxCpltCallback;
    HAL_DMA_Init(&LCD_DMA_HANDLE);
    HAL_DMA_Start_IT(&LCD_DMA_HANDLE, dmastatus.ptr, LCD_ADDR_DATA, dmastatus.trsize);
    LcdDmaWaitEnd(Mode & LCD_IO_MULTIDATA);
  }
  else
  #endif /* #if LCD_DMA_TX == 1 */
  { /* not DMA mode */
    uint16_t * pD16 = (uint16_t *)pData;
    uint16_t c16;

    if(Mode & LCD_IO_FILL)
    { /* fill */
      if(Mode & LCD_IO_DATA8)
      { /* fill 8bit */
        while(Size--) /* fill 8bit */
          *(volatile uint8_t *)LCD_ADDR_DATA = *pData;
      }
      else if(Mode & LCD_IO_DATA16)
      { /* fill 16bit */
        #if LCD_REVERSE16 == 0
        c16 = *pD16;
        #elif LCD_REVERSE16 == 1
          c16 = __REVSH(*pD16);   // get the RGB565 in the original state first
        #endif
        {
          while(Size--) { 
            /* AE: Original code used 16b transfers. The FMC section of the F76x ref says larger AHB accesses are split, but I get HardFault...
            // *(volatile uint16_t *)LCD_ADDR_DATA = c16;
            */
            // AE: 8bit FSMC I/F, so accesses are uint8_t !
            // AE: send them as expected by controller: high byte, low byte
            *(volatile uint8_t *)LCD_ADDR_DATA = (c16 >> 8) & 0xFF;
            *(volatile uint8_t *)LCD_ADDR_DATA = c16 & 0xFF;
          }
        }
      }
    }
    else
    { /* multidata */
      if(Mode & LCD_IO_DATA8)
      { /* multidata 8bit */
        while(Size--)
        {
          *(volatile uint8_t *)LCD_ADDR_DATA = *pData;
          pData++;
        }
      }
      else
      { /* multidata 16bit */
        #if LCD_REVERSE16 == 0
          while(Size--)
          {
            c16 = *pD16;
            // AE: changed to 8bit access
            *(volatile uint8_t *)LCD_ADDR_DATA = c16 >> 8;
            *(volatile uint8_t *)LCD_ADDR_DATA = c16 & 0xFF;
            pD16++;
          }
        #else //LCD_REVERSE16 == 1
          Size <<= 1;  // AE: Convert size from 16b to 8b. The order of the bytes is already reversed. No need to convert to/from 16b
          // AE: essentially this is LCD_IO_DATA8 with 2x the size.
          // AE: Not really tested. This combination of options is not really used
          while(Size--)
          {
            *(volatile uint8_t *)LCD_ADDR_DATA = *pData;
            pData++;
          }
        #endif
      }
    }
    LcdTransEnd();
  }
}

