efthym/stm32_hal_graphics_display_drivers/Drivers/io_fsmc/lcd_io_fsmc8_hal.c
//-----------------------------------------------------------------------------
/* Wrtite fill and multi data to Lcd (convert RGB16 bit (5-6-5) to RGB24 bit (8-8-8) mode, no dma capability)
   - pData: RGB 16 bits data pointer
   - Size: data number
   - dinc: 0=fill mode, 1=multidata mode */
void LCDWriteFillMultiData16to24(uint16_t * pData, uint32_t Size, uint32_t Mode)
{
  union
  {
    uint8_t  c8[4];
    uint32_t c24;
  }rgb888;
  #if LCD_REVERSE16 == 1
  uint16_t c16;
  #endif

  #if LCD_DMA_TX == 1 && LCD_RGB24_BUFFSIZE > 0
  if(Size > DMA_MINSIZE)
  { /* DMA mode */
    dmastatus.maxtrsize = LCD_RGB24_BUFFSIZE;
    dmastatus.size = Size;

    if(Size > LCD_RGB24_BUFFSIZE)
      dmastatus.trsize = LCD_RGB24_BUFFSIZE;
    else
      dmastatus.trsize = Size;

    if(Mode & LCD_IO_FILL)
    {
      dmastatus.status = DMA_STATUS_FILL | DMA_STATUS_24BIT;
      FillConvert16to24(*(uint16_t *)pData, lcd_rgb24_dma_buffer, dmastatus.trsize);
    }
    else
    {
      dmastatus.status = DMA_STATUS_MULTIDATA | DMA_STATUS_24BIT;
      dmastatus.ptr = (uint32_t)pData;
      BitmapConvert16to24((uint16_t *)pData, lcd_rgb24_dma_buffer, dmastatus.trsize);
    }

    LCD_DMA_HANDLE.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    LCD_DMA_HANDLE.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    LCD_DMA_HANDLE.Init.PeriphInc = DMA_PINC_ENABLE;
    LCD_DMA_HANDLE.Init.MemInc = DMA_MINC_DISABLE;
    LCD_DMA_HANDLE.XferCpltCallback = &HAL_DMA_TxCpltCallback;
    HAL_DMA_Init(&LCD_DMA_HANDLE);
    HAL_DMA_Start_IT(&LCD_DMA_HANDLE,  (uint32_t)&lcd_rgb24_dma_buffer, LCD_ADDR_DATA, dmastatus.trsize * 3);

    LcdDmaWaitEnd(m & LCD_IO_FILL);
  }
  else
  #endif
  { /* not DMA mode */
    if(Mode & LCD_IO_FILL)
    { /* fill 16bit to 24bit */
      #if LCD_REVERSE16 == 0
      rgb888.c24 = RGB565TO888(*pData);
      #elif LCD_REVERSE16 == 1
      c16 = __REVSH(*pData);
      rgb888.c24 = RGB565TO888(c16);
      #endif
      while(Size--)
      {
        *(volatile uint8_t *)LCD_ADDR_DATA = rgb888.c8[0];
        *(volatile uint8_t *)LCD_ADDR_DATA = rgb888.c8[1];
        *(volatile uint8_t *)LCD_ADDR_DATA = rgb888.c8[2];
      }
    }
    else
    { /* multidata 16bit to 24bit */
      while(Size--)
      {
        #if LCD_REVERSE16 == 0
        rgb888.c24 = RGB565TO888(*pData);
        #elif LCD_REVERSE16 == 1
        c16 = __REVSH(*pData);
        rgb888.c24 = RGB565TO888(c16);
        #endif
        *(volatile uint8_t *)LCD_ADDR_DATA = rgb888.c8[0];
        *(volatile uint8_t *)LCD_ADDR_DATA = rgb888.c8[1];
        *(volatile uint8_t *)LCD_ADDR_DATA = rgb888.c8[2];
        pData++;
      }
    }
    LcdTransEnd();
  }
}

//=============================================================================
/* Read */

#if LCD_DATADIR == 1

/* RX DMA */
#if LCD_DMA_RX == 1

//-----------------------------------------------------------------------------
/* DMA operation end callback function prototype */
__weak void LCD_IO_DmaRxCpltCallback(DMA_HandleTypeDef *hdma)
{
  UNUSED(hdma);
}

//-----------------------------------------------------------------------------
/* Convert from 16bit bitmnap to 24bit bitmap */
void BitmapConvert24to16(uint8_t * src, uint16_t * tg, uint32_t Size)
{
  uint32_t c24;
  while(Size--)
  {
    c24 = *(uint32_t *)src;
    #if LCD_REVERSE16 == 0
    *tg = RGB888TO565(c24);
    #elif LCD_REVERSE16 == 1
    *tg = __REVSH(RGB888TO565(c24));
    #endif
    src += 3;
    tg++;
  }
}

//-----------------------------------------------------------------------------
/* SPI DMA operation interrupt */
void HAL_DMA_RxCpltCallback(DMA_HandleTypeDef *hdma)
{
  if(hdma == &LCD_DMA_HANDLE)
  {
    #if LCD_RGB24_BUFFSIZE > 0
    if(dmastatus.status == (DMA_STATUS_MULTIDATA | DMA_STATUS_24BIT))
    {
      BitmapConvert24to16(lcd_rgb24_dma_buffer, (uint16_t *)dmastatus.ptr, dmastatus.trsize);
      dmastatus.ptr += dmastatus.trsize << 1; /* 24bit multidata */
    }
    else
    #endif /* LCD_RGB24_BUFFSIZE > 0 */
    {
      if(dmastatus.status == (DMA_STATUS_MULTIDATA | DMA_STATUS_8BIT))
        dmastatus.ptr += dmastatus.trsize;        /* 8bit multidata */
      else if(dmastatus.status == (DMA_STATUS_MULTIDATA | DMA_STATUS_16BIT))
        dmastatus.ptr += dmastatus.trsize << 1;   /* 16bit multidata */
    }

    if(dmastatus.size > dmastatus.trsize)
    { /* dma operation is still required */
      dmastatus.size -= dmastatus.trsize;
      if(dmastatus.size <= dmastatus.maxtrsize)
        dmastatus.trsize = dmastatus.size;

      #if LCD_RGB24_BUFFSIZE > 0
      if(dmastatus.status == (DMA_STATUS_MULTIDATA | DMA_STATUS_24BIT))
        HAL_DMA_Start_IT(&LCD_DMA_HANDLE, LCD_ADDR_DATA, (uint32_t)&lcd_rgb24_dma_buffer, dmastatus.trsize * 3);
      else
      #endif /* #if LCD_RGB24_BUFFSIZE > 0 */
      HAL_DMA_Start_IT(&LCD_DMA_HANDLE, LCD_ADDR_DATA, dmastatus.ptr, dmastatus.trsize);
    }
    else
    { /* dma operations have ended */
      LcdDmaTransEnd();
      LCD_IO_DmaRxCpltCallback(hdma);
    }
  }
}
#endif  /* #if LCD_DMA_RX == 1 */

//-----------------------------------------------------------------------------
/* Read data from Lcd
   - pData: 8 or 16 bits data pointer
   - Size: data number
   - bitdepth: 0 = 8bit data, 1 = 16bit data */
void LCDReadMultiData8and16(uint8_t * pData, uint32_t Size, uint32_t Mode)
{
  #if LCD_DMA_RX == 1
  #if LCD_REVERSE16 == 0
  if((Size > DMA_MINSIZE) && (!LCD_DMA_UNABLE((uint32_t)pData)) && (Mode & LCD_IO_DATA8))
  #elif LCD_REVERSE16 == 1
  if((Size > DMA_MINSIZE) && (!LCD_DMA_UNABLE((uint32_t)pData)) && (Mode & (LCD_IO_DATA8 | LCD_IO_REVERSE16)))
  #endif
  { /* DMA mode */
    /* RX DMA setting (8bit, 16bit, multidata) */
    if(Mode & LCD_IO_DATA8)
    {
      LCD_DMA_HANDLE.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
      LCD_DMA_HANDLE.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
      dmastatus.status = DMA_STATUS_MULTIDATA | DMA_STATUS_8BIT;
    }
    else
    {
      LCD_DMA_HANDLE.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
      LCD_DMA_HANDLE.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
      dmastatus.status = DMA_STATUS_MULTIDATA | DMA_STATUS_16BIT;
    }
    LCD_DMA_HANDLE.Init.PeriphInc = DMA_PINC_DISABLE;
    LCD_DMA_HANDLE.Init.MemInc = DMA_MINC_ENABLE;

    dmastatus.maxtrsize = DMA_MAXSIZE;
    dmastatus.size = Size;

    if(Size > DMA_MAXSIZE)
      dmastatus.trsize = DMA_MAXSIZE;
    else
      dmastatus.trsize = Size;

