efthym/stm32_hal_graphics_display_drivers/Drivers/io_fsmc/lcd_io_fsmc8_hal.c
    dmastatus.ptr = (uint32_t)pData;

    LCD_DMA_HANDLE.XferCpltCallback = &HAL_DMA_RxCpltCallback;
    HAL_DMA_Init(&LCD_DMA_HANDLE);
    HAL_DMA_Start_IT(&LCD_DMA_HANDLE, LCD_ADDR_DATA, dmastatus.ptr, dmastatus.trsize);
    LcdDmaWaitEnd(Mode & LCD_IO_MULTIDATA);
  }
  else
  #endif /* #if LCD_DMA_RX == 1 */
  { /* not DMA mode */
    if(Mode & LCD_IO_DATA8)
    { /* 8bit */
      while(Size--)
      {
        *pData = *(volatile uint8_t *)LCD_ADDR_DATA;
        pData++;
      }
    }
    else
    { /* 16bit */
      uint16_t * pD16 = (uint16_t *)pData;
      #if LCD_REVERSE16 == 1
      if(Mode & LCD_IO_REVERSE16)
      {
        while(Size--)
        {
          *pD16 = *(volatile uint16_t *)LCD_ADDR_DATA;
          pD16++;
        }
      }
      else
      #endif
      {
        while(Size--)
        {
          *pD16 = __REVSH(*(volatile uint16_t *)LCD_ADDR_DATA);
          pD16++;
        }
      }
    }
    LcdTransEnd();
  }
}

//-----------------------------------------------------------------------------
/* Read 24bit (8-8-8) RGB data from LCD, and convert to 16bit (5-6-5) RGB data
   - pData: 16 bits RGB data pointer
   - Size: pixel number */
void LCDReadMultiData24to16(uint16_t * pData, uint32_t Size, uint32_t Mode)
{
  union
  {
    uint8_t  c8[4];
    uint32_t c24;
  }rgb888;

  #if LCD_DMA_RX == 1 && LCD_RGB24_BUFFSIZE > 0
  if(Size > DMA_MINSIZE)
  { /* DMA mode */
    /* SPI RX DMA setting (8bit, multidata) */
    LCD_DMA_HANDLE.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    LCD_DMA_HANDLE.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    LCD_DMA_HANDLE.Init.MemInc = DMA_MINC_ENABLE;

    dmastatus.maxtrsize = LCD_RGB24_BUFFSIZE;
    dmastatus.size = Size;

    if(Size > LCD_RGB24_BUFFSIZE)
      dmastatus.trsize = LCD_RGB24_BUFFSIZE;
    else
      dmastatus.trsize = Size;

    dmastatus.status = DMA_STATUS_MULTIDATA | DMA_STATUS_24BIT;
    dmastatus.ptr = (uint32_t)pData;
    LCD_DMA_HANDLE.XferCpltCallback = &HAL_DMA_RxCpltCallback;
    HAL_DMA_Init(&LCD_DMA_HANDLE);
    HAL_DMA_Start_IT(&LCD_DMA_HANDLE, LCD_ADDR_DATA, (uint32_t)&lcd_rgb24_dma_buffer, dmastatus.trsize * 3);
    LcdDmaWaitEnd(1);
  }
  else
  #endif /* #if LCD_DMA_RX == 1 && LCD_RGB24_BUFFSIZE > 0 */
  { /* not DMA mode */
    while(Size--)
    {
      rgb888.c8[0] = *(volatile uint8_t *)LCD_ADDR_DATA;
      rgb888.c8[1] = *(volatile uint8_t *)LCD_ADDR_DATA;
      rgb888.c8[2] = *(volatile uint8_t *)LCD_ADDR_DATA;
      #if LCD_REVERSE16 == 0
      *pData = RGB888TO565(rgb888.c24);
      #elif LCD_REVERSE16 == 1
      *pData = __REVSH(RGB888TO565(rgb888.c24));
      #endif
      pData++;
    }
    LcdTransEnd();
  }
}

#endif /* #if LCD_DATADIR == 1 */

//=============================================================================
/* Public functions */

/* n millisec delay */
void LCD_Delay(uint32_t Delay)
{
  #ifndef  osCMSIS
  HAL_Delay(Delay);
  #else
  osDelay(Delay);
  #endif
}

/* Backlight on-off (Bl=0 -> off, Bl=1 -> on) */
//-----------------------------------------------------------------------------
void LCD_IO_Bl_OnOff(uint8_t Bl)
{
  #if defined(LCD_BL_GPIO_Port) && defined (LCD_BL_Pin)
  if(Bl)
    #if LCD_BLON == 0
    HAL_GPIO_WritePin(LCD_BL_GPIO_Port, LCD_BL_Pin, GPIO_PIN_RESET);
    #elif LCD_BLON == 1
    HAL_GPIO_WritePin(LCD_BL_GPIO_Port, LCD_BL_Pin, GPIO_PIN_SET);
    #endif
  else
    #if LCD_BLON == 0
    HAL_GPIO_WritePin(LCD_BL_GPIO_Port, LCD_BL_Pin, GPIO_PIN_SET);
    #elif LCD_BLON == 1
    HAL_GPIO_WritePin(LCD_BL_GPIO_Port, LCD_BL_Pin, GPIO_PIN_RESET);
    #endif
  #endif
}

//-----------------------------------------------------------------------------
/* Lcd IO init, reset, spi speed init, get the freertos task id */
void LCD_IO_Init(void)
{
  #if defined(LCD_RST_GPIO_Port) && defined (LCD_RST_Pin)
  HAL_GPIO_WritePin(LCD_RST_GPIO_Port, LCD_RST_Pin, GPIO_PIN_SET);   // AE: added
  HAL_Delay(10);
  HAL_GPIO_WritePin(LCD_RST_GPIO_Port, LCD_RST_Pin, GPIO_PIN_RESET);
  HAL_Delay(10);
  HAL_GPIO_WritePin(LCD_RST_GPIO_Port, LCD_RST_Pin, GPIO_PIN_SET);
  #endif
  LCD_Delay(10);
  LcdTransInit();
}

//-----------------------------------------------------------------------------
/* Lcd IO transaction
   - Cmd: 8 or 16 bits command
   - pData: 8 or 16 bits data pointer
   - Size: data number
   - DummySize: dummy byte number at read
   - Mode: 8 or 16 or 24 bit mode, write or read, fill or multidata (see the LCD_IO_... defines) */
void LCD_IO_Transaction(uint16_t Cmd, uint8_t *pData, uint32_t Size, uint32_t DummySize, uint32_t Mode)
{
  #if LCD_DATADIR == 0  /* only TX mode */
  if(Mode & LCD_IO_READ)
    return;
  #endif

  LcdTransStart();

  /* Command write */
  if(Mode & LCD_IO_CMD8)
    *(volatile uint8_t *)LCD_ADDR_BASE = Cmd;
  else if(Mode & LCD_IO_CMD16)
    *(volatile uint16_t *)LCD_ADDR_BASE = __REVSH(Cmd);

  //printf("\nCMD %x ", Cmd);

  if(Size == 0)
  { /* only command byte or word */
    LcdTransEnd();
    return;
  }

  /* Datas write or read */
  if(Mode & LCD_IO_WRITE)
  { /* Write Lcd */
    if(Mode & LCD_IO_DATA16TO24)
      LCDWriteFillMultiData16to24((uint16_t *)pData, Size, Mode);
    else
      LCDWriteFillMultiData8and16(pData, Size, Mode);
  }
  #if LCD_DATADIR == 1
  else if(Mode & LCD_IO_READ)
  { /* Read LCD */
    uint8_t RxDummy __attribute__((unused));
    while(DummySize--)
      RxDummy = *(volatile uint8_t *)LCD_ADDR_DATA;
    if(Mode & LCD_IO_DATA24TO16)
      LCDReadMultiData24to16((uint16_t *)pData, Size, Mode);
    else
      LCDReadMultiData8and16(pData, Size, Mode);
  }
  #endif /* #if LCD_DATADIR == 1 */
}
